%设计窗函数并绘出其时域频域图
%矩形窗
clear all;
[x,fs]=audioread('D:\MYData\voice\sy2\清音f.m4a');   %清音的获取
[y,fs]=audioread('D:\MYData\voice\sy2\浊音b.m4a');   %浊音的获取
wlen=960;                                            %设置窗长
win=hamming(wlen);                                           
inc=400;                                            	  %设置帧移
xf=enframe(x,win,inc)';                                 %分帧、加汉明窗
yf=enframe(y,win,inc)';                                 %分帧、加汉明窗
x = linspace(0,100,10001);              %在0~100的横坐标间取10001个值
h = zeros(10001,1);                      %为矩阵h赋0值
h(1:2001) = 0;                              
h(2002:8003) = 1;                        %窗内值取为1
h(8004:10001) = 0;                       
figure(1);
subplot(1,2,1);
plot(x,h,'b');
title('矩形窗时域波形');
xlabel('样点数');
ylabel('幅度');
axis([0,100,- 0.5,1.5]);                %限定横纵坐标范围
line([0,100],[0,0]);            
w1 = linspace(0,61,61);
w1(1:61) = 1;
w2 = fft(w1,1024);                       %对时域信号进行1024点的傅里叶变换
w3 = w2/w2(1);                           %幅度归一化
w4 = 20*log10(abs(w3));                 %对归一化幅度的模值取对数
w = 2*[0:1023]/1024;                    %频率归一化
subplot(1,2,2);
plot(w,w4,'b');
axis([0,1,- 100,100]);
title('矩形窗幅度特性');
xlabel('归一化频率 f/fs');
ylabel('幅度/dB');
%-----------------------------------------------------------------------
%汉明窗
x = linspace(20,80,61);                    %在20~80之间取61个值
h = hamming(61);                            %取61个点的汉明窗值为纵坐标值
figure(1);                                   %画图
subplot(1,2,1);                             %分配画布
plot(x,h,'b');                              %画出波形图
title('汉明窗时域波形');                        
xlabel('样点数');
ylabel('幅度');
w1 = linspace(0,61,61);                     %取窗长内的61个点
w1(1:61) = hamming(61);                     %加汉明窗
w2 = fft(w1,1024);                          %对时域信号做1024点傅里叶变换
w3 = w2/w2(1);                               %幅度归一化
w4 = 20*log10(abs(w3));                
w = 2*[0:1023]/1024;                         %频率归一化
subplot(1,2,2);
plot(w,w4,'b');
axis([0,1,-100,0]);
title('汉明窗幅度特性');
xlabel('归一化频率');
ylabel('幅度/dB');
%-----------------------------------------------------------------------
%绘制一帧语音信号的时域频域图
%-----------------------------------------------------------------------
%轻音
fn1=size(xf,2);                                      %帧数
xf1=xf(:,200);										   %取出第200帧
lxf1=length(xf1);          						   %一帧的长度
txf1=(0:lxf1-1)/fs;         						   %一帧对应的时间
figure('Name','清音','NumberTitle','off');                                          
subplot(2,1,1);                                      %绘制一帧清音信号时域图
plot(txf1,xf1);
xlabel('时间/s');
ylabel('幅度');
title('清音信号时域图');
grid;

xf2=fft(xf1); 										   %傅里叶变换
xf3=20*log10(abs(xf2+eps));
subplot(2,1,2);
plot(fs*(0:lxf1/2-1)/lxf1,xf3(1:lxf1/2));          %绘制一帧清音信号频谱图
title('清音信号频谱图');
xlabel('频率hz');
ylabel('幅度db');
grid;
%-----------------------------------------------------------------------
%浊音
fn2=size(yf,2);                                    %帧数
yf1=yf(:,200);										 %取出第200帧
lyf1=length(yf1);
tyf1=(0:lyf1-1)/fs;
figure('Name','浊音','NumberTitle','off');                                          
subplot(2,1,1);                                    %绘制一帧浊音信号时域图
plot(tyf1,yf1);
xlabel('时间/s');
ylabel('幅度');
title('浊音信号时域图');
grid;

yf2=fft(yf1);
yf3=20*log10(abs(yf2+eps));
subplot(2,1,2);
plot(fs*(0:lyf1/2-1)/lyf1,yf3(1:lyf1/2))          %绘制一帧浊音信号频谱图
title('浊音信号频谱图');
xlabel('频率hz');
ylabel('幅度db');
grid;
%-----------------------------------------------------------------------
%绘制语谱图
%-----------------------------------------------------------------------
%清音信号语谱图
figure('Name','清音信号语谱图','NumberTitle','off');
spectrogram(x(:,2),win,560,1024,fs,'yaxis');
%-----------------------------------------------------------------------
%浊音信号语谱图
figure('Name','浊音信号语谱图','NumberTitle','off');
spectrogram(y(:,2),win,560,1024,fs,'yaxis');


